In [1]:
# importing pandas as pd 
import pandas as pd 
  
# importing numpy as np 
import numpy as np

## create a DataFrame

In [2]:
# dictionary of lists 
data_dict = {'First':[100, 90, np.nan, 95], 
        'Second': [30, 45, 56, np.nan], 
        'Third':[np.nan, 40, 80, 98]} 
  
# creating a dataframe from list 
data_df = pd.DataFrame(data_dict)

In [3]:
# see some lines
data_df.head()

   First  Second  Third
0  100.0    30.0    NaN
1   90.0    45.0   40.0
2    NaN    56.0   80.0
3   95.0     NaN   98.0

In [6]:
# size
data_df.shape

(4, 3)

## Detecting missing values

## a values in Panada DataFrame that is `NaN` represents missing values

In [7]:
# test if a values is missing in all columns
# isna() returns True if the value of the cell NaN. False if the value is not missing
data_df.isna()

   First  Second  Third
0  False   False   True
1  False   False  False
2   True   False  False
3  False    True  False

In [8]:
# test if a values is missing in all columns
# notna() returns False if the value of the cell NaN. True if the value is not missing
data_df.notna()

   First  Second  Third
0   True    True  False
1   True    True   True
2  False    True   True
3   True   False   True

In [9]:
data_df['First'].notna()

0     True
1     True
2    False
3     True
Name: First, dtype: bool

In [10]:
# test if any value of every column is NaN
# any() return True if any value of the column is True
data_df.isna().any()

First     True
Second    True
Third     True
dtype: bool

In [11]:
# if any of the values is True then `any` returns True
# if all of the values are False then `any` returns False
pd.Series([False,False]).any()

False

In [12]:
pd.Series([True,False]).any()

True

# Filtering data with missing values

In [15]:
data_df

   First  Second  Third
0  100.0    30.0    NaN
1   90.0    45.0   40.0
2    NaN    56.0   80.0
3   95.0     NaN   98.0

In [14]:
data_df['First'].isna()

0    False
1    False
2     True
3    False
Name: First, dtype: bool

In [13]:
data_df[data_df['First'].isna()]

   First  Second  Third
2    NaN    56.0   80.0

In [16]:
# get data with NO null
data_df[~data_df['First'].isna()]

   First  Second  Third
0  100.0    30.0    NaN
1   90.0    45.0   40.0
3   95.0     NaN   98.0

In [17]:
# get data with NO null
data_df[data_df['First'].notna()]

   First  Second  Third
0  100.0    30.0    NaN
1   90.0    45.0   40.0
3   95.0     NaN   98.0

## drop rows with `NaN`

In [10]:
# drop every row if it has at least one `NaN`
data_df.dropna(axis=0, how='any')

NameError: name 'data_df' is not defined

In [20]:
clean_df = data_df.dropna(axis=0, how='any')
clean_df

   First  Second  Third
1   90.0    45.0   40.0

In [21]:
data_df

   First  Second  Third
0  100.0    30.0    NaN
1   90.0    45.0   40.0
2    NaN    56.0   80.0
3   95.0     NaN   98.0

## drop columns with `NaN`

In [22]:
# this will return a new data frame with columns has no missing
# note as our data frame has missing in all columns then this method will not return
# any clean column
data_df.dropna(axis=1, how='any')

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

## drop if all values of rows/columns are `NaN`

In [23]:
# using dropna() function     
data_df.dropna(how = 'all')

   First  Second  Third
0  100.0    30.0    NaN
1   90.0    45.0   40.0
2    NaN    56.0   80.0
3   95.0     NaN   98.0

In [24]:
# add a new column to have all `NaN`
data_df['Fourth'] = np.nan
data_df

   First  Second  Third  Fourth
0  100.0    30.0    NaN     NaN
1   90.0    45.0   40.0     NaN
2    NaN    56.0   80.0     NaN
3   95.0     NaN   98.0     NaN

In [25]:
# using dropna() function     
data_df = data_df.dropna(axis=1, how = 'all') 
data_df

   First  Second  Third
0  100.0    30.0    NaN
1   90.0    45.0   40.0
2    NaN    56.0   80.0
3   95.0     NaN   98.0

## compute percentage of  `NaN` in every column

In [26]:
# this will return a new DataFrame with clean no missing data
percent_missing = data_df.isna().sum() / data_df.shape[0]
percent_missing

First     0.25
Second    0.25
Third     0.25
dtype: float64

In [27]:
data_df.drop(columns=['First'])

   Second  Third
0    30.0    NaN
1    45.0   40.0
2    56.0   80.0
3     NaN   98.0

## Fill missing values with constant

In [28]:
# fill all columns
data_df.fillna(-1)

   First  Second  Third
0  100.0    30.0   -1.0
1   90.0    45.0   40.0
2   -1.0    56.0   80.0
3   95.0    -1.0   98.0

In [29]:
# fill a column
data_df['First'].fillna('First Missing')

0              100
1               90
2    First Missing
3               95
Name: First, dtype: object

# note that fillna doesn't change the object. it returns a new dataframe/series with the updated filled values

In [30]:
data_df

   First  Second  Third
0  100.0    30.0    NaN
1   90.0    45.0   40.0
2    NaN    56.0   80.0
3   95.0     NaN   98.0

In [31]:
data_df_filled = data_df.fillna(-1)
data_df_filled

   First  Second  Third
0  100.0    30.0   -1.0
1   90.0    45.0   40.0
2   -1.0    56.0   80.0
3   95.0    -1.0   98.0

In [32]:
# still original dataframe not changed
data_df

   First  Second  Third
0  100.0    30.0    NaN
1   90.0    45.0   40.0
2    NaN    56.0   80.0
3   95.0     NaN   98.0

## you can use the `inplace` command to update the same dataframe.

In [33]:
# data_df.fillna(-1, inplace=True)
# this will mutate the data_df

## fill by previous/next value

In [35]:
data_df

   First  Second  Third
0  100.0    30.0    NaN
1   90.0    45.0   40.0
2    NaN    56.0   80.0
3   95.0     NaN   98.0

In [34]:
# fill by using previous value. Forward filling
# notice that the first value cannot be handled using this method as 
# there is no previous value for it
data_df.fillna(method='ffill')

   First  Second  Third
0  100.0    30.0    NaN
1   90.0    45.0   40.0
2   90.0    56.0   80.0
3   95.0    56.0   98.0

In [36]:
# fill by using next value. Backward filling
# notice that the last value cannot be handled using this method as 
# there is no next value to it
data_df.fillna(method='bfill')

   First  Second  Third
0  100.0    30.0   40.0
1   90.0    45.0   40.0
2   95.0    56.0   80.0
3   95.0     NaN   98.0

In [37]:
data_df.fillna(method='bfill').fillna(method='ffill')

   First  Second  Third
0  100.0    30.0   40.0
1   90.0    45.0   40.0
2   95.0    56.0   80.0
3   95.0    56.0   98.0

## handle missing values for columns differently

In [38]:
# copy the data
data_copy = data_df.copy()
data_copy

   First  Second  Third
0  100.0    30.0    NaN
1   90.0    45.0   40.0
2    NaN    56.0   80.0
3   95.0     NaN   98.0

In [39]:
# First column
data_copy['First'].fillna(-1, inplace=True)
data_copy['Second'].fillna(method='bfill', inplace=True)
data_copy['Third'].fillna('Third', inplace=True)
data_copy

   First  Second  Third
0  100.0    30.0  Third
1   90.0    45.0     40
2   -1.0    56.0     80
3   95.0     NaN     98

## Fill missing values using interpolation

In [42]:
data_df

   First  Second  Third
0  100.0    30.0    NaN
1   90.0    45.0   40.0
2    NaN    56.0   80.0
3   95.0     NaN   98.0

In [41]:
# note that the third value of the first column becomes 92.5 which is the average of 90 and 95
data_df.interpolate(method ='linear')

   First  Second  Third
0  100.0    30.0    NaN
1   90.0    45.0   40.0
2   92.5    56.0   80.0
3   95.0    56.0   98.0

## Fill missing values by the mean

In [43]:
data_df

   First  Second  Third
0  100.0    30.0    NaN
1   90.0    45.0   40.0
2    NaN    56.0   80.0
3   95.0     NaN   98.0

In [44]:
# the mean will compute the missing.
# it doesn't consider `NaN` values
data_df.mean()

First     95.000000
Second    43.666667
Third     72.666667
dtype: float64

In [45]:
type(data_df.mean())

pandas.core.series.Series

In [46]:
data_df.fillna(data_df.mean())

   First     Second      Third
0  100.0  30.000000  72.666667
1   90.0  45.000000  40.000000
2   95.0  56.000000  80.000000
3   95.0  43.666667  98.000000

In [47]:
# you can round it for better vis
data_df.fillna(data_df.mean()).round(2)

   First  Second  Third
0  100.0   30.00  72.67
1   90.0   45.00  40.00
2   95.0   56.00  80.00
3   95.0   43.67  98.00

## fill missing with most frequent

In [48]:
df = pd.DataFrame([('bird', 2, 2),
                   (np.nan, 4, 2),
                   ('arthropod', 8, 0),
                   ('bird', 2, np.nan)],
                  columns=('species', 'legs', 'wings'))

In [49]:
df

     species  legs  wings
0       bird     2    2.0
1        NaN     4    2.0
2  arthropod     8    0.0
3       bird     2    NaN

In [50]:
# get the mode of evey column
df.mode()

  species  legs  wings
0    bird     2    2.0

In [54]:
type(df.mode())

pandas.core.frame.DataFrame

In [53]:
type(df.mode().iloc[-1])

pandas.core.series.Series

## note the the mode is a DataFrame

In [55]:
# we need to take the last row of the mode DataFrame to fill missing values
df.fillna(df.mode().iloc[-1])

     species  legs  wings
0       bird     2    2.0
1       bird     4    2.0
2  arthropod     8    0.0
3       bird     2    2.0

# Fill missing values using advance techniques
# k-NN algorithm

In [56]:
#knn k-nearest neighbor

In [57]:
df = pd.DataFrame([(1, 5, 3),
                    (2, 8, 0),
                   (np.nan, 5, 3),
                   (2, 8, np.nan)],
                  columns=('species', 'legs', 'wings'))

In [58]:
df

   species  legs  wings
0      1.0     5    3.0
1      2.0     8    0.0
2      NaN     5    3.0
3      2.0     8    NaN

In [59]:
from sklearn.impute import KNNImputer

In [60]:
model = KNNImputer(n_neighbors=1)

In [61]:
model.fit_transform(df)

array([[1., 5., 3.],
       [2., 8., 0.],
       [1., 5., 3.],
       [2., 8., 0.]])

In [62]:
type(model.fit_transform(df))

numpy.ndarray

In [63]:
model.fit_transform(df).shape

(4, 3)